/*
 * Author  Kayson.Wan
 * Date  2024-07-12 11:31:59
 * LastEditors  Kayson.Wan
 * LastEditTime  2026-03-12 17:44:29
 * Description 张江科学会堂
 */
import * as THREE from 'three';
import { BlendFunction } from 'postprocessing';

export default {
  // 实体模型镜头初始视角位置
  entityCameraInitialPosition: {
    x: 2499259.7150648776,
    y: 153.71003485381038,
    z: 5849079.669596614
  },

  // 实体模型场景中心目标位置
  entiySceneInitialPosition: { x: 37.34309912655562, y: 22.80866533381508, z: 5.801774535538348 },

  /**
   * 新版配置
   */
  modelQueue: [
    {
      title: 'terrain',
      type: 'draco',
      draco: '/models/张江科学会堂/地形.glb'
    }
    // {
    //   title: '张江科学会堂_b2',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/b2.glb'
    // },
    // {
    //   title: '张江科学会堂_b1',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/b1.glb'
    // },
    // {
    //   title: '张江科学会堂_f1',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f1.glb'
    // },
    // {
    //   title: '张江科学会堂_f1',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f1地面.glb'
    // },
    // {
    //   title: '张江科学会堂_f1m1',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f1m1.glb'
    // },
    // {
    //   title: '张江科学会堂_f1m2',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f1m2.glb'
    // },
    // {
    //   title: '张江科学会堂_f2',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f2.glb'
    // },
    // {
    //   title: '张江科学会堂_f3',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f3.glb'
    // },
    // {
    //   title: '张江科学会堂_f4',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f4.glb'
    // },
    // {
    //   title: '张江科学会堂_f5',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f5.glb'
    // },
    // {
    //   title: '张江科学会堂_f6',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/f6.glb'
    // },
    // {
    //   title: '张江科学会堂_dg',
    //   type: 'draco',
    //   draco: '/models/张江科学会堂/顶层.glb'
    // }
  ],

  // 楼层配置
  roomConfig: [
    {
      floor: '张江科学会堂_b1',
      roomName: '10kV开关站',
      position: { x: 92.42136766985539, y: 14.754873275756836, z: -8.091863619468178 },
      cameraPos: { x: 94.14086503514675, y: 28.759670810717076, z: -2.7790311796558713 },
      targetPos: { x: 90.08260753351144, y: 14.870807696603713, z: -8.52150479079602 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/10kV开关室.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'X1变电所',
      position: { x: 104.4134424918824, y: 14.754873275756836, z: -15.742974641870894 },
      cameraPos: { x: 105.7645653981478, y: 32.26671573317233, z: -8.402236062548102 },
      targetPos: { x: 100.89838229806813, y: 14.577079263485185, z: -15.439963367213243 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1x1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'X2变电所',
      position: { x: -65.01125779213517, y: 10.754871845245361, z: 75.64229871928639 },
      cameraPos: { x: -60.27022721725162, y: 32.98813412511895, z: 85.34026442301743 },
      targetPos: { x: -67.46992859410783, y: 14.010270577754122, z: 75.0166588375655 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1x2.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'X3变电所',
      position: { x: 16.374733196906426, y: 10.754871845245361, z: -42.55993386480455 },
      cameraPos: { x: 24.90464366278203, y: 32.451392323738204, z: -48.317596550552345 },
      targetPos: { x: 12.503093330013618, y: 14.469273107756472, z: -44.76804827799762 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1x3.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_临时用电室',
      roomName: '临时用电室',
      position: { x: 94.39829670722948, y: 40.10153388977051, z: -4.944929637156797 },
      cameraPos: { x: 587.1161525804789, y: 9.579670166744972, z: -176.27754727848912 },
      targetPos: { x: 583.6455360547303, y: 2.671903712944096, z: -181.88610424058743 },
      roomQuene: [
        {
          title: '张江科学会堂_临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/临时用电室1.glb'
        }
      ]
    },
    // b1
    {
      floor: '张江科学会堂_b1',
      roomName: 'B1强电间1_北',
      position: { x: -26.091057687016878, y: 10.754871845245376, z: -30.922174222177716 },
      cameraPos: { x: -28.07852348219156, y: 24.096971466667306, z: -30.271861900952572 },
      targetPos: { x: -26.233505638030486, y: 17.67583050077104, z: -30.953084325179745 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'B1强电间2_西北',
      position: { x: -68.11492052349277, y: 10.754871845245361, z: -7.115402074919203 },
      cameraPos: { x: -67.60205590812454, y: 21.74274675271845, z: -6.156670567225426 },
      targetPos: { x: -67.99015019052611, y: 16.99893529146692, z: -7.242273474232216 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'B1强电间3_西',
      position: { x: -53.70066800006941, y: 10.754871845245376, z: 60.33889674457067 },
      cameraPos: { x: -52.35202513285875, y: 23.92100306331035, z: 62.85893553726644 },
      targetPos: { x: -53.07254571499617, y: 17.39939150837361, z: 60.9284007812252 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'B1强电间4_西南',
      position: { x: -25.021832904270102, y: 10.754871845245361, z: 72.00473274267245 },
      cameraPos: { x: -20.25299125344983, y: 48.3142742215416, z: 80.26879462754647 },
      targetPos: { x: -29.574607465791694, y: 4.396948553029839, z: 66.93894007566378 },
      roomQuene: []
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'B1强电间5_西右',
      position: { x: -26.505193712736798, y: 10.754871845245347, z: 40.49279220416694 },
      cameraPos: { x: -23.939068707586735, y: 24.816895294095524, z: 44.15832203972689 },
      targetPos: { x: -26.683136928375845, y: 11.888650345601466, z: 40.23432115508066 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      roomName: 'B1强电间6_南',
      position: { x: 46.612532277923286, y: 10.754871845245361, z: 21.932994009039316 },
      cameraPos: { x: 48.22016731433808, y: 22.409762308511134, z: 23.94728297467104 },
      targetPos: { x: 46.58001350951674, y: 16.047538982694622, z: 21.59758284654946 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    // ---
    {
      floor: '张江科学会堂_b1',
      // roomName: 'B1强电间7_南',
      roomName: 'B1强电间7_东南',
      position: { x: 109.49041367780752, y: 10.754871845245361, z: -23.980068483075613 },
      cameraPos: { x: 110.08157443748375, y: 22.561300746490055, z: -22.698189820503615 },
      targetPos: { x: 108.02853642924778, y: 11.78920126484624, z: -25.552130483035842 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      // roomName: 'B1强电间8_南',
      roomName: 'B1强电间8_东北',
      position: { x: 48.92389943624165, y: 10.754871845245361, z: -37.98618130846987 },
      cameraPos: { x: 50.49134615870889, y: 24.19587354378708, z: -33.52601068497368 },
      targetPos: { x: 49.80633378559513, y: 20.458891998205825, z: -34.454318334131635 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b1',
      // roomName: 'B1强电间9_南',
      roomName: 'B1强电间9_东北左',
      position: { x: 35.30669457546999, y: 10.754871845245376, z: -30.79082947713649 },
      cameraPos: { x: 38.242981008015235, y: 23.603679309476327, z: -32.331348163044076 },
      targetPos: { x: 35.49764812271363, y: 16.130301919181544, z: -30.70272554475391 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b1sb.glb'
        }
      ]
    },
    // b2
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间1_北',
      position: { x: -26.476373470375368, y: -13.450499003298306, z: -31.9004111512195 },
      cameraPos: { x: -28.80863966991882, y: -1.6764795751811565, z: -31.43857634369288 },
      targetPos: { x: -26.534431541537987, y: -9.228647805259087, z: -32.19850047915726 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间2_西北',
      position: { x: -70.54833684715335, y: -13.450499003298319, z: -5.412920830390856 },
      cameraPos: { x: -65.2251608115644, y: -0.5672990966949358, z: -7.623835159476558 },
      targetPos: { x: -69.49422523388424, y: -8.361229080799093, z: -5.708724613256266 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间3_西北左',
      position: { x: -82.58870961449078, y: -13.450499003298319, z: 18.144499728989597 },
      cameraPos: { x: -79.75404126844454, y: -1.8634770563950163, z: 16.168580580822656 },
      targetPos: { x: -83.02474056910555, y: -9.634611030276265, z: 17.84787050302512 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间4_西',
      position: { x: -55.17928190447518, y: -13.450499003298319, z: 32.3785272042243 },
      cameraPos: { x: -57.48251739357799, y: -3.070496602112968, z: 33.904617714745385 },
      targetPos: { x: -54.57835760060705, y: -10.275681572152198, z: 32.90677523045181 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间5_西左',
      position: { x: -48.138717027627926, y: -13.450499003298319, z: 49.37858647277379 },
      cameraPos: { x: -50.47092940883668, y: -3.6730004888758163, z: 50.42962145211305 },
      targetPos: { x: -47.016437369231895, y: -12.937972633611968, z: 49.115405163413755 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间6_东南',
      position: { x: -25.056505840696286, y: -13.450499003298331, z: 72.37228690403583 },
      cameraPos: { x: -23.640496154096997, y: -3.140791111330392, z: 74.3290605664892 },
      targetPos: { x: -26.722724864256804, y: -16.084090319369338, z: 70.03568104514231 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间7_南',
      position: { x: 46.58034483942454, y: -13.450499003298319, z: 21.62507412342425 },
      cameraPos: { x: 48.06580689619767, y: -4.066924136352085, z: 24.337184466907537 },
      targetPos: { x: 36.17771876462081, y: -45.907988740717656, z: 6.663410475690731 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间8_东南',
      position: { x: 109.2603308704933, y: -13.450499003298319, z: -24.279538274134488 },
      cameraPos: { x: 109.99366167678421, y: -4.229178164848447, z: -22.98176934813264 },
      targetPos: { x: 109.06321759940562, y: -9.72189213196125, z: -24.306768092679512 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_b2',
      roomName: 'B2强电间9_东北',
      position: { x: 49.044368603239455, y: -13.450499003298319, z: -35.22465923673523 },
      cameraPos: { x: 49.100828742695356, y: -1.9184064443349058, z: -35.712970465442595 },
      targetPos: { x: 48.506199121192346, y: -8.24002016166398, z: -36.54332908726438 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/b2sb.glb'
        }
      ]
    },
    // f1
    {
      floor: '张江科学会堂_f1',
      roomName: 'F1强电间1_北',
      position: { x: -23.80542920430127, y: 40.005550146102905, z: -37.07650453109655 },
      cameraPos: { x: -23.436700443475882, y: 53.28665209052427, z: -35.62540452226063 },
      targetPos: { x: -23.900368504737035, y: 47.780520109197205, z: -36.877168137211164 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1',
      roomName: 'F1强电间2_西',
      position: { x: -52.645453551707874, y: 40.00555014610292, z: 6.558131249368937 },
      cameraPos: { x: -54.186765735405416, y: 51.74597377143225, z: 7.2146870906878 },
      targetPos: { x: -51.846374355547965, y: 42.451613877600984, z: 6.2434065203452205 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1',
      roomName: 'F1强电间3_西南',
      position: { x: -16.95714507224725, y: 40.005550146102905, z: 75.47664400926413 },
      cameraPos: { x: -15.992434107712103, y: 52.75622385996539, z: 76.80914478772365 },
      targetPos: { x: -17.836777236372654, y: 39.00320070665855, z: 74.17885398595409 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1',
      roomName: 'F1强电间4_南',
      position: { x: 33.665563713634555, y: 40.005550146102905, z: 40.5247469204551 },
      cameraPos: { x: 34.575968439120636, y: 52.92353537656454, z: 41.931895431418766 },
      targetPos: { x: 31.925875402480322, y: 38.077830401728, z: 38.03331958467222 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1',
      roomName: 'F1强电间5_南右',
      position: { x: 54.24547326229687, y: 40.005550146102905, z: 25.359927939303937 },
      cameraPos: { x: 54.94347383660526, y: 49.812806818265955, z: 26.812826658553686 },
      targetPos: { x: 52.963793071870484, y: 39.0256934890107, z: 23.921365894985662 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1',
      roomName: 'F1强电间6_北岛',
      position: { x: 55.50215033571309, y: 40.005550146102905, z: -36.62685117134634 },
      cameraPos: { x: 55.57562450394945, y: 55.61912001891439, z: -36.43334885766737 },
      targetPos: { x: 54.14998190681359, y: 44.91191726461792, z: -38.47284884752495 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1sb.glb'
        }
      ]
    },
    // f1m1
    {
      floor: '张江科学会堂_f1m1',
      roomName: 'F1M1强电间1_西北',
      position: { x: -22.89544440514684, y: 66.12112998962402, z: -37.96178751112917 },
      cameraPos: { x: -22.670202822215618, y: 76.47046300466297, z: -39.093228017802524 },
      targetPos: { x: -22.27927568541195, y: 72.21394067831069, z: -38.10186326030554 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1m1',
      roomName: 'F1M1强电间2_西',
      position: { x: -60.1256342631009, y: 66.12112998962402, z: 2.1360167633371248 },
      cameraPos: { x: -58.0256207477849, y: 76.58093463404646, z: 0.7470820141688705 },
      targetPos: { x: -61.14639412156373, y: 67.56782388420667, z: 1.8955015891024662 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1m1',
      roomName: 'F1M1强电间3_西右',
      position: { x: -51.36969096395444, y: 66.12112998962404, z: 6.537471605424894 },
      cameraPos: { x: -52.96229160218577, y: 75.29549920610248, z: 7.086973742163443 },
      targetPos: { x: -49.11710381297647, y: 65.70289503504765, z: 5.5856177987131215 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1m1',
      roomName: 'F1M1强电间4_西南',
      position: { x: -15.317959871283115, y: 66.12112998962402, z: 76.5144505123076 },
      cameraPos: { x: -14.71785505278895, y: 75.48147162569379, z: 77.72409515446458 },
      targetPos: { x: -17.24402540819302, y: 62.11232288114037, z: 74.17690891137923 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1m1',
      roomName: 'F1M1强电间5_南',
      position: { x: 35.59332591636043, y: 66.12112998962402, z: 41.596217885867226 },
      cameraPos: { x: 39.93953652647559, y: 90.89383577621385, z: 46.403790982514806 },
      targetPos: { x: 33.40552809375487, y: 62.27722941590856, z: 37.29914162342288 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m1sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1m1',
      roomName: 'F1M1强电间6_南右',
      position: { x: 56.01714286288257, y: 66.12112998962402, z: 24.820707874585416 },
      cameraPos: { x: 57.9813359063033, y: 77.86042941918765, z: 23.778252949255027 },
      targetPos: { x: 55.000353983121656, y: 68.42727124976511, z: 25.323083859970357 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m1sb.glb'
        }
      ]
    },
    // f1m2
    {
      floor: '张江科学会堂_f1m2',
      roomName: 'F1M2强电间1_西南',
      position: { x: -16.108697425512844, y: 91.21822404861449, z: 76.21355855015703 },
      cameraPos: { x: -15.110582801242991, y: 101.51969622887648, z: 77.90732562616867 },
      targetPos: { x: -17.139470556659944, y: 90.60341412827138, z: 75.06085586409861 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1m2',
      roomName: 'F1M2强电间2_南',
      position: { x: 35.817587309801205, y: 91.2182240486145, z: 41.58999311065327 },
      cameraPos: { x: 36.9506474947823, y: 102.64332187971982, z: 42.78867802331337 },
      targetPos: { x: 35.351261760784354, y: 90.79672136723269, z: 40.48240036765883 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m2sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f1m2',
      roomName: 'F1M2强电间3_南右',
      position: { x: 55.50490760361415, y: 91.2182240486145, z: 25.6743479201074 },
      cameraPos: { x: 57.978984222186085, y: 102.71702285830374, z: 24.82058388330129 },
      targetPos: { x: 54.78475266561211, y: 92.02544685357982, z: 25.93957959049578 },
      roomQuene: [
        {
          title: '张江科学会堂_b1',
          type: 'draco',
          draco: '/models/张江科学会堂/f1m2sb.glb'
        }
      ]
    },
    // f2
    {
      floor: '张江科学会堂_f2',
      roomName: 'F2强电间1_西南',
      position: { x: -0.30822945047896866, y: 117.003799200058, z: 61.81189846627183 },
      cameraPos: { x: 9.242845294430923, y: 160.42546989542248, z: 78.15467284931589 },
      targetPos: { x: -2.7606639203903796, y: 115.06616853063744, z: 60.38603419218458 },
      roomQuene: [
        {
          title: '张江科学会堂_临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f2sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f2',
      roomName: 'F2强电间2_南',
      position: { x: 51.19388983300506, y: 117.00379920005798, z: 25.9416676352156 },
      cameraPos: { x: 60.69074181330397, y: 162.47116622927268, z: 38.17712194278168 },
      targetPos: { x: 48.68723259848264, y: 117.11186486448875, z: 20.40848328564701 },
      roomQuene: [
        {
          title: '张江科学会堂_临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f2sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f2',
      roomName: 'F2强电间3_东北左',
      position: { x: 51.358784892578406, y: 117.00379920005798, z: -37.06721534828063 },
      cameraPos: { x: 52.72529082942755, y: 132.40380639296055, z: -36.32207704354179 },
      targetPos: { x: 51.4468021924417, y: 125.91114425729126, z: -38.126377979854325 },
      roomQuene: [
        {
          title: '张江科学会堂_临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f2sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f2',
      roomName: 'F2强电间4_南右',
      position: { x: 68.32903806108318, y: 117.00379920005798, z: 2.4709864882545887 },
      cameraPos: { x: 69.77660743241651, y: 130.9463116038309, z: 1.1581339626662515 },
      targetPos: { x: 67.08861334410307, y: 120.19705254004295, z: 2.973458768683106 },
      roomQuene: [
        {
          title: '张江科学会堂_临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f2sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f2',
      roomName: 'F2强电间5_东北',
      position: { x: 76.23956952608252, y: 117.003799200058, z: -58.63602301521828 },
      cameraPos: { x: 77.3683670424571, y: 129.14430498143216, z: -57.39112126408952 },
      targetPos: { x: 76.83351088528018, y: 125.99940462740189, z: -58.13581288164853 },
      roomQuene: [
        {
          title: '张江科学会堂_临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f2sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f2',
      roomName: 'F2强电间6_北',
      position: { x: -1.5414138795407233, y: 116.99589877072553, z: -51.2465306383696 },
      cameraPos: { x: -0.851293106332901, y: 137.16989098291702, z: -48.91243286742592 },
      targetPos: { x: -1.5041008464377532, y: 125.84350168702467, z: -51.56432934184724 },
      roomQuene: [
        {
          title: '张江科学会堂_临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f2sb1.glb'
        }
      ]
    },
    // f3
    {
      floor: '张江科学会堂_f3',
      roomName: 'F3强电间1_西南',
      position: { x: -16.683740913406467, y: 142.7628297805786, z: 74.14279716622536 },
      cameraPos: { x: -18.245566025500978, y: 153.70207822809948, z: 77.39523165306248 },
      targetPos: { x: -19.459684780161083, y: 147.9804185082371, z: 75.6868233078972 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f3sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f3',
      roomName: 'F3强电间2_南',
      position: { x: 53.37427239121667, y: 142.7628297805786, z: 25.011066343745554 },
      cameraPos: { x: 52.090040241850744, y: 129.7412592121782, z: 27.928143319830305 },
      targetPos: { x: 49.43751095693277, y: 116.20877285681433, z: 24.141280175819126 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f3sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f3',
      roomName: 'F3强电间3(实)_东南',
      position: { x: 113.73287711701207, y: 142.7628297805786, z: -19.49119660743328 },
      cameraPos: { x: 115.35538919912516, y: 154.27232291859872, z: -20.89213485081266 },
      targetPos: { x: 113.89021804346176, y: 149.66280987478066, z: -19.918968285447953 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f3sb1.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f3',
      roomName: 'F3强电间3（实际是4）_东北',
      position: { x: 78.87022984028299, y: 142.7628297805786, z: -60.20114120160851 },
      cameraPos: { x: 81.95017206981055, y: 168.4166627140688, z: -54.74730846813018 },
      targetPos: { x: 80.10509762464785, y: 155.5097023479188, z: -57.53567970517034 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f3sb1.glb'
        }
      ]
    },
    // f4
    // {
    //   floor: '张江科学会堂_f4',
    //   roomName: 'F4_1#强电间',
    //   position: { x: -18.974043469424608, y: 168.5280687212944, z: 75.73202175974882 },
    //   cameraPos: { x: -11.388786257531905, y: 206.0979147928772, z: 87.31367718867564 },
    //   targetPos: { x: -19.927462613615365, y: 169.1948926205628, z: 75.17352136377171 },
    //   roomQuene: []
    // },
    {
      floor: '张江科学会堂_f4',
      roomName: 'F4强电间2_南',
      position: { x: 53.07707301208485, y: 168.5280687212944, z: 25.127191255261632 },
      cameraPos: { x: 54.404026777755135, y: 179.27837938111972, z: 26.72528761915279 },
      targetPos: { x: 52.27686139695168, y: 169.4148302756968, z: 23.696014095532664 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f4sb.glb'
        }
      ]
    },
    // f5
    {
      floor: '张江科学会堂_f5',
      roomName: 'F5强电间1_西南',
      position: { x: -15.588811399801223, y: 194.41025972731836, z: 76.37474353861118 },
      cameraPos: { x: -14.66680920406085, y: 204.26043207309624, z: 77.76423008526282 },
      targetPos: { x: -15.96016041905103, y: 198.47886253241123, z: 75.90394095125039 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f5sb.glb'
        }
      ]
    },
    {
      floor: '张江科学会堂_f5',
      roomName: 'F5强电间2_南',
      position: { x: 54.86168869617266, y: 194.3301061987877, z: 25.960262016748658 },
      cameraPos: { x: 56.29395974230161, y: 205.61069296651712, z: 27.800636635847088 },
      targetPos: { x: 54.97670701735402, y: 198.34350001382288, z: 25.845412330473337 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f5sb.glb'
        }
      ]
    },
    // {
    //   floor: '张江科学会堂_f5',
    //   roomName: 'F5_3#强电间',
    //   position: { x: 89.09142362498463, y: 194.3301061987877, z: -7.419002462678208 },
    //   cameraPos: { x: 87.37392415070175, y: 206.59069482182093, z: -5.531288270572911 },
    //   targetPos: { x: 88.38954673341533, y: 200.36237012371404, z: -7.168645833966485 },
    //   roomQuene: []
    // },
    // f6
    {
      floor: '张江科学会堂_f6',
      roomName: 'F6强电间1_西南',
      position: { x: -10.429669445153777, y: 227.7323188781738, z: 72.27155231640594 },
      cameraPos: { x: -15.653896300419888, y: 230.13605223327147, z: 75.46612924947112 },
      targetPos: { x: -16.831401745578383, y: 226.45135964371957, z: 76.29825518547068 },
      roomQuene: [
        {
          title: '临时用电室',
          type: 'draco',
          draco: '/models/张江科学会堂/f6sb1.glb'
        }
      ]
    }
  ],

  // 楼层分层相关配置 [透视视角]
  floorBoomConfig: {
    // cameraPosition: { x: -38.744258897473195, y: 242.34781524323728, z: -200.42900114552884 },
    // targetPosition: { x: 37.34309912655562, y: 22.80866533381508, z: 5.801774535538348 },
    cameraPosition: { x: 91.62374152581432, y: 277.8575918811838, z: -358.62705913044687 },
    targetPosition: { x: 48.81091506000569, y: 100.76236762289658, z: 21.73930310615649 },
    BoomOffsetY: 20,
    floorOffset: { x: -0.08712855857639923, y: 138.908903204749, z: 175.72985492494317 }
  },
  roomTagScale: 0.9,
  waterLevelHeight: -2,
  /**
   * 墙体流光效果
   */
  flowWallMeshNames: ['D1PDF001_1'],
  /**
   * 设置流光的墙体缩放
   */
  flowWallScale: { x: 1, y: 1, z: 0.2 },
  /**
   * 设置透明的材质名称
   */
  transparentMeshConfig: [
    {
      opacity: 0.3,
      meshNames: ['D1PDF001_1', 'D1PDF030']
    }
  ],

  // 后处理配置
  postSetting: {
    bloomEffect: {
      blendFunction: 28,
      inverted: false,
      ignoreBackground: true,
      opacity: 1,
      threshold: 0.2,
      smoothing: 0.9,
      // intensity: 10
      intensity: 0
    },
    outlineEffect: {
      blendFunction: 28,
      visibleEdgeColor: '#00ffff',
      hiddenEdgeColor: '#00ffff',
      pulseSpeed: 0.7,
      edgeStrength: 2,
      blur: false
    },
    lut3DEffect: { blendFunction: BlendFunction.SOFT_LIGHT, tetrahedralInterpolation: false },
    vignetteEffect: {
      blendFunction: 23,
      technique: 0,
      offset: 0.5,
      darkness: 0.5
    },
    smaaEffect: { preset: 1, edgeDetectionMode: 2, predicationMode: 0 },
    hueSaturationEffect: { blendFunction: 9, hue: 0, saturation: 0.25 },
    brightnessContrastEffect: { blendFunction: 23, brightness: 0, contrast: 0 }
  },

  /**
   * 灯光配置
   */
  baseLighting: {
    controllers: {
      输出设置: ''
    },
    folders: {
      环境: { controllers: { tone曝光度: 1, toneMapping: 4 }, folders: {} },
      灯光: {
        controllers: {
          环境光强度: 0.5,
          环境光颜色: '#fafafa',
          启用平行光: true,
          平行光强度: 1,
          平行光颜色: '#fffbe5',
          平行光位置x: 10,
          平行光位置y: 10,
          平行光位置z: 10
        },
        folders: {}
      },
      阴影: {
        controllers: {
          接收阴影: true,
          阴影分辨率: 2048,
          阴影范围上下宽度: 30,
          阴影范围左右宽度: 30,
          阴影贴图偏差: -0.0008,
          shadowCamera最远距离: 100,
          shadowCamera最近距离: 0
        },
        folders: {}
      },
      雾: {
        controllers: { 启用雾: true, 雾颜色: '#aed8ff', 雾最近距离: 0, 雾最远距离: 5427 },
        folders: {}
      },
      天空盒: {
        controllers: { 启用背景: false, environment: { none: 'none', blueSky: 'blueSky' } },
        folders: {}
      }
    }
  },
  lightTarget: { x: 0, y: 0, z: 0 },
  // 1.根据两个端点坐标生成树木
  linePointsTreePositions: [
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 488.18066113614714, y: 0.2000000029801754, z: -187.7692778207757 },
        { x: 227.42410040347863, y: 0.2000000029801754, z: -135.95676175166363 },
        { x: -128.7027925811569, y: 0.20000000298011855, z: -55.943474546262166 },
        { x: -112.49423596385088, y: 0.20000000298021803, z: 37.12948969688384 },
        { x: -110.47096164717499, y: 0.20000000298026066, z: 58.041475513685754 },
        { x: -101.15333196702342, y: 0.20000000298023224, z: 167.02742114329916 },
        { x: -89.86403993163412, y: 0.20000000298023224, z: 169.34934285303996 },
        { x: -48.56966921882885, y: 0.20000000298023224, z: 135.7838552993684 },
        { x: -12.597732260207337, y: 0.20000000298023934, z: 108.02492398935166 },
        { x: 62.04938955398319, y: 0.20000000298023224, z: 53.59654546186822 },
        { x: 104.1783751484941, y: 0.20000000298024645, z: 25.24971344737739 },
        { x: 130.7968099543453, y: 0.20000000298021803, z: 8.915653536292496 },
        { x: 171.3187095644128, y: 0.20000000298023224, z: -16.107543039456033 },
        { x: 247.54156784101053, y: 0.20000000298023224, z: -56.720624056879956 },
        { x: 341.29628472648545, y: 0.20000000298034593, z: -102.06191320906078 }
      ]
    },
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 273.85959508127587, y: 0.20000000298023224, z: -381.6429635165431 },
        { x: 330.3904000836398, y: 0.20000000298023224, z: -219.38511759259535 },
        { x: -135.37222892341242, y: 0.20000000298023224, z: -117.42229028010945 },
        { x: -135.43894392133356, y: 0.20000000298023224, z: -142.51813143280026 },
        { x: -91.69231201936225, y: 0.20000000298023224, z: -161.20426770343852 },
        { x: -49.78328476493003, y: 0.20000000298011855, z: -196.55438997617415 },
        { x: -10.943935626045459, y: 0.20000000298023224, z: -241.99186043237944 },
        { x: 211.32064528661624, y: 0.20000000298023224, z: -293.9542630286406 },
        { x: 262.84694906466433, y: 0.20000000298023224, z: -333.0864786830894 }
      ]
    },
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: -153.39230984313878, y: 0.20000000298028908, z: -49.8415441612066 },
        { x: -154.39618303374954, y: 0.20000000298023224, z: -12.922211931816491 },
        { x: -197.97469860180678, y: 0.20000000298023224, z: -3.6793965997890155 },
        { x: -198.25882568594028, y: 0.20000000298023224, z: 27.074865137568622 },
        { x: -157.4950827057543, y: 0.20000000298023224, z: 20.65503855111649 },
        { x: -142.00610504610313, y: 0.20000000298023224, z: 207.14813824207835 },
        { x: -444.20276229607606, y: 0.2000000029801754, z: 441.95499153722994 }
      ]
    },
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 345.93406484248146, y: 0.20000000298028908, z: 152.2891676738322 },
        { x: 257.5846755865393, y: 0.20000000298028908, z: -31.710290074733734 },
        { x: 137.37254754499014, y: 0.20000000298023224, z: 33.77502389707911 },
        { x: 111.2757759629904, y: 0.20000000298023224, z: 51.17152500746823 },
        { x: 6.587144360423025, y: 0.20000000298028908, z: 126.77495165317173 },
        { x: 121.36114980433479, y: 0.20000000298028908, z: 291.18617876378966 },
        { x: 218.59248711284823, y: 0.20000000298028908, z: 226.00388157939528 },
        { x: 123.28589131233596, y: 0.20000000298023224, z: 69.54413117194815 },
        { x: 150.10231291476282, y: 0.20000000298023224, z: 55.61975169461304 },
        { x: 241.10594375887263, y: 0.20000000298023224, z: 213.69653337715638 },
        { x: 324.5107020016048, y: 0.2000000029801754, z: 165.93898714502544 }
      ]
    }
  ],
  // 2.单个树位置列表
  treePositions: [
    { x: -132.20474853341514, y: -0.7581900500546226, z: 96.37734177384806 },
    { x: 118.76595072750894, y: -0.5174407622753279, z: 100.47691880927579 }
  ],
  // 3.根据端点生成的区域生成树木
  areaPointsTreePositions: [
    {
      name: 'area1',
      radius: 30,
      scale: 1,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 167.20969216680027, y: -0.5174361539907295, z: 162.45795978269018 },
        { x: 162.78717017958886, y: -0.5174326827684581, z: 207.96825814638424 }
      ]
    }
  ],

  // 4.根据地形模型生成片区草资源
  grassTerrainPath: '',

  // cameraLinePos: [
  //   { x: 652.9837057458794, y: 1168.4055116593486, z: 1114.3016662715656 },
  //   { x: -11.431081404284757, y: 22.653917770173678, z: 28.144613355479855 }
  // ]
  // outsideRoomMeshNames: ['#5WG001', '#7WG', ]
  outsideRoomMeshNames: ['5HaoLou', '7HaoLou', '1HShiWai'],
  // 其他辅助类灯光
  otherLightsConfig: [
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 655.8,
      position: [-43.975519069860624, 50.15215170620756, 0.17273110764307376],
      scale: [1, 1, 1],
      distance: 45.9,
      decay: 1
    },
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 1000,
      position: [-24.248202807596282, 28.404262641977354, 84.65073288396778],
      scale: [1, 1, 1],
      distance: 42.2,
      decay: 1
    },
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 1000,
      position: [35.0705305870827, 5.967574342783141, -56.362375876254134],
      scale: [1, 1, 1],
      distance: 47.1,
      decay: 1.361
    },
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 1000,
      position: [88.27342195282344, 5.584124654264187, -69.38824098163794],
      scale: [1, 1, 1],
      distance: 42,
      decay: 1
    }
  ]
};
