import * as THREE from 'three';
import { BlendFunction } from 'postprocessing';

export default {
  /**
   * 新版配置
   */
  modelQueue: [
    {
      title: '开关站',
      // path: '/models/A0开关站.glb'
      path: '/models/10kV配电房0724.glb'
    }
  ],

  // 楼层配置
  roomConfig: [
    {
      floor: '_b1',
      roomName: '10kV开关站',
      position: { x: 92.42136766985539, y: 14.754873275756836, z: -8.091863619468178 },
      cameraPos: { x: 94.14086503514675, y: 28.759670810717076, z: -2.7790311796558713 },
      targetPos: { x: 90.08260753351144, y: 14.870807696603713, z: -8.52150479079602 },
      roomQuene: [
        {
          title: '_b1',
          type: 'draco',
          draco: '/models/10kV开关室.glb'
        }
      ]
    }
  ],

  // 楼层分层相关配置 [透视视角]
  floorBoomConfig: {
    // cameraPosition: { x: -38.744258897473195, y: 242.34781524323728, z: -200.42900114552884 },
    // targetPosition: { x: 37.34309912655562, y: 22.80866533381508, z: 5.801774535538348 },
    cameraPosition: { x: 91.62374152581432, y: 277.8575918811838, z: -358.62705913044687 },
    targetPosition: { x: 48.81091506000569, y: 100.76236762289658, z: 21.73930310615649 },
    BoomOffsetY: 20,
    floorOffset: { x: -0.08712855857639923, y: 138.908903204749, z: 175.72985492494317 }
  },
  roomTagScale: 0.9,
  waterLevelHeight: -2,
  /**
   * 墙体流光效果
   */
  flowWallMeshNames: ['D1PDF001_1'],
  /**
   * 设置流光的墙体缩放
   */
  flowWallScale: { x: 1, y: 1, z: 0.2 },
  /**
   * 设置透明的材质名称
   */
  transparentMeshConfig: [
    {
      opacity: 0.3,
      meshNames: ['D1PDF001_1', 'D1PDF030']
    }
  ],

  // 后处理配置
  postSetting: {
    bloomEffect: {
      blendFunction: 28,
      inverted: false,
      ignoreBackground: true,
      opacity: 1,
      threshold: 0.2,
      smoothing: 0.9,
      // intensity: 10
      intensity: 0
    },
    outlineEffect: {
      blendFunction: 28,
      visibleEdgeColor: '#00ffff',
      hiddenEdgeColor: '#00ffff',
      pulseSpeed: 0.7,
      edgeStrength: 2,
      blur: false
    },
    lut3DEffect: { blendFunction: BlendFunction.SOFT_LIGHT, tetrahedralInterpolation: false },
    vignetteEffect: {
      blendFunction: 23,
      technique: 0,
      offset: 0.5,
      darkness: 0.5
    },
    smaaEffect: { preset: 1, edgeDetectionMode: 2, predicationMode: 0 },
    hueSaturationEffect: { blendFunction: 9, hue: 0, saturation: 0.25 },
    brightnessContrastEffect: { blendFunction: 23, brightness: 0, contrast: 0 }
  },

  /**
   * 灯光配置
   */
  baseLighting: {
    controllers: {
      输出设置: ''
    },
    folders: {
      环境: { controllers: { tone曝光度: 1, toneMapping: 4 }, folders: {} },
      灯光: {
        controllers: {
          环境光强度: 2,
          环境光颜色: '#ffffff',
          启用平行光: true,
          平行光强度: 2,
          平行光颜色: '#fffbe5',
          平行光位置x: 10,
          平行光位置y: 10,
          平行光位置z: 10
        },
        folders: {}
      },
      阴影: {
        controllers: {
          接收阴影: true,
          阴影分辨率: 2048,
          阴影范围上下宽度: 30,
          阴影范围左右宽度: 30,
          阴影贴图偏差: -0.0008,
          shadowCamera最远距离: 100,
          shadowCamera最近距离: 0
        },
        folders: {}
      },
      雾: {
        controllers: { 启用雾: true, 雾颜色: '#aed8ff', 雾最近距离: 0, 雾最远距离: 5427 },
        folders: {}
      },
      天空盒: {
        controllers: { 启用背景: false, environment: { none: 'none', blueSky: 'blueSky' } },
        folders: {}
      }
    }
  },
  lightTarget: { x: 0, y: 0, z: 0 },
  // 1.根据两个端点坐标生成树木
  linePointsTreePositions: [
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 488.18066113614714, y: 0.2000000029801754, z: -187.7692778207757 },
        { x: 227.42410040347863, y: 0.2000000029801754, z: -135.95676175166363 },
        { x: -128.7027925811569, y: 0.20000000298011855, z: -55.943474546262166 },
        { x: -112.49423596385088, y: 0.20000000298021803, z: 37.12948969688384 },
        { x: -110.47096164717499, y: 0.20000000298026066, z: 58.041475513685754 },
        { x: -101.15333196702342, y: 0.20000000298023224, z: 167.02742114329916 },
        { x: -89.86403993163412, y: 0.20000000298023224, z: 169.34934285303996 },
        { x: -48.56966921882885, y: 0.20000000298023224, z: 135.7838552993684 },
        { x: -12.597732260207337, y: 0.20000000298023934, z: 108.02492398935166 },
        { x: 62.04938955398319, y: 0.20000000298023224, z: 53.59654546186822 },
        { x: 104.1783751484941, y: 0.20000000298024645, z: 25.24971344737739 },
        { x: 130.7968099543453, y: 0.20000000298021803, z: 8.915653536292496 },
        { x: 171.3187095644128, y: 0.20000000298023224, z: -16.107543039456033 },
        { x: 247.54156784101053, y: 0.20000000298023224, z: -56.720624056879956 },
        { x: 341.29628472648545, y: 0.20000000298034593, z: -102.06191320906078 }
      ]
    },
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 273.85959508127587, y: 0.20000000298023224, z: -381.6429635165431 },
        { x: 330.3904000836398, y: 0.20000000298023224, z: -219.38511759259535 },
        { x: -135.37222892341242, y: 0.20000000298023224, z: -117.42229028010945 },
        { x: -135.43894392133356, y: 0.20000000298023224, z: -142.51813143280026 },
        { x: -91.69231201936225, y: 0.20000000298023224, z: -161.20426770343852 },
        { x: -49.78328476493003, y: 0.20000000298011855, z: -196.55438997617415 },
        { x: -10.943935626045459, y: 0.20000000298023224, z: -241.99186043237944 },
        { x: 211.32064528661624, y: 0.20000000298023224, z: -293.9542630286406 },
        { x: 262.84694906466433, y: 0.20000000298023224, z: -333.0864786830894 }
      ]
    },
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: -153.39230984313878, y: 0.20000000298028908, z: -49.8415441612066 },
        { x: -154.39618303374954, y: 0.20000000298023224, z: -12.922211931816491 },
        { x: -197.97469860180678, y: 0.20000000298023224, z: -3.6793965997890155 },
        { x: -198.25882568594028, y: 0.20000000298023224, z: 27.074865137568622 },
        { x: -157.4950827057543, y: 0.20000000298023224, z: 20.65503855111649 },
        { x: -142.00610504610313, y: 0.20000000298023224, z: 207.14813824207835 },
        { x: -444.20276229607606, y: 0.2000000029801754, z: 441.95499153722994 }
      ]
    },
    {
      radius: 50,
      scale: 0.8,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 345.93406484248146, y: 0.20000000298028908, z: 152.2891676738322 },
        { x: 257.5846755865393, y: 0.20000000298028908, z: -31.710290074733734 },
        { x: 137.37254754499014, y: 0.20000000298023224, z: 33.77502389707911 },
        { x: 111.2757759629904, y: 0.20000000298023224, z: 51.17152500746823 },
        { x: 6.587144360423025, y: 0.20000000298028908, z: 126.77495165317173 },
        { x: 121.36114980433479, y: 0.20000000298028908, z: 291.18617876378966 },
        { x: 218.59248711284823, y: 0.20000000298028908, z: 226.00388157939528 },
        { x: 123.28589131233596, y: 0.20000000298023224, z: 69.54413117194815 },
        { x: 150.10231291476282, y: 0.20000000298023224, z: 55.61975169461304 },
        { x: 241.10594375887263, y: 0.20000000298023224, z: 213.69653337715638 },
        { x: 324.5107020016048, y: 0.2000000029801754, z: 165.93898714502544 }
      ]
    }
  ],
  // 2.单个树位置列表
  treePositions: [
    { x: -132.20474853341514, y: -0.7581900500546226, z: 96.37734177384806 },
    { x: 118.76595072750894, y: -0.5174407622753279, z: 100.47691880927579 }
  ],
  // 3.根据端点生成的区域生成树木
  areaPointsTreePositions: [
    {
      name: 'area1',
      radius: 30,
      scale: 1,
      color: new THREE.Color(150 / 255, 150 / 255, 150 / 255),
      positions: [
        { x: 167.20969216680027, y: -0.5174361539907295, z: 162.45795978269018 },
        { x: 162.78717017958886, y: -0.5174326827684581, z: 207.96825814638424 }
      ]
    }
  ],

  // 4.根据地形模型生成片区草资源
  grassTerrainPath: '',

  // cameraLinePos: [
  //   { x: 652.9837057458794, y: 1168.4055116593486, z: 1114.3016662715656 },
  //   { x: -11.431081404284757, y: 22.653917770173678, z: 28.144613355479855 }
  // ]
  // outsideRoomMeshNames: ['#5WG001', '#7WG', ]
  outsideRoomMeshNames: ['5HaoLou', '7HaoLou', '1HShiWai'],
  // 其他辅助类灯光
  otherLightsConfig: [
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 655.8,
      position: [-43.975519069860624, 50.15215170620756, 0.17273110764307376],
      scale: [1, 1, 1],
      distance: 45.9,
      decay: 1
    },
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 1000,
      position: [-24.248202807596282, 28.404262641977354, 84.65073288396778],
      scale: [1, 1, 1],
      distance: 42.2,
      decay: 1
    },
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 1000,
      position: [35.0705305870827, 5.967574342783141, -56.362375876254134],
      scale: [1, 1, 1],
      distance: 47.1,
      decay: 1.361
    },
    {
      type: 'PointLight',
      color: 16757327,
      intensity: 1000,
      position: [88.27342195282344, 5.584124654264187, -69.38824098163794],
      scale: [1, 1, 1],
      distance: 42,
      decay: 1
    }
  ]
};
